sd2-dsi-fceia/SHIELD-MCXC444-DSI/SD2_4_MCXC444_TestShield_CAN-BUS/source/mcp2515.c
/* Copyright 2026, DSI FCEIA UNR - Sistemas Digitales 2
 *    DSI: http://www.dsi.fceia.unr.edu.ar/
 * Copyright 2026, Agustin M. Zuliani (amzuliani02@gmail.com)
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <spi_can.h>
#include "mcp2515.h"
#include "fsl_gpio.h"
#include "pin_mux.h"
#include "fsl_port.h"
#include <string.h>

/**
 * @def Chip select en estado alto
 * @brief Pone en alto el pin de chip select. Esto hace
 * que se finilize la comunicacion con el dispositivo.
 */
#define CS_HIGH spi_cs_high()
/**
 * @def Chip select en estado bajo
 * @brief Pone en bajo el pin de chip select. Esto hace
 * que se inicie la comunicacion con el dispositivo.
 */
#define CS_LOW spi_cs_low()

/*
 * =============
 * IMPORTANTE!!!
 * =============
 *
 * Debe definirse el siguiente uso de del sistema. Si se utiliza
 * freertos entonces debe setearse en '1', si no se utiliza debe
 * configurarse en '0'. De esto dependerá que tipo de delay se va
 * a utilizar. Si se no se utiliza freertos el delay consistirá en
 * un bulce for de tipo bloqueante. Si se utiliza freertos el delay
 * consistirá en el típico vtaskDelay.
 * */

/**
 * @brief Registro de configuracion 1
 *
 * Utilizado para manejar a nivel de bits el registro
 * de configuracion 1 del modulo.
 */
typedef union
{
	struct
	{
		/**
		 * @brief Baud rate prescaler bits
		 * */
		unsigned BRP : 6;
		/**
		 * @brief Synchronization jump width lenght bits
		 * */
		unsigned SJW : 2;
	};
	uint8_t data;
} CNF1_t;

/**
 * @brief Registro de configuracion 2
 */
typedef union
{
	struct
	{
		/**
		 * @brief Propagation segment lenght bits
		 * */
		unsigned PRSEG : 3;
		/**
		 * @brief PS1 lenght bits
		 */
		unsigned PHSEG : 3;
		/**
		 * @brief Sample point configuration bits
		 */
		unsigned SAM : 1;
		/**
		 * @brief PS2 bit time length bit
		 */
		unsigned BTLMODE : 1;
	};
	uint8_t data;
} CNF2_t;

/**
 * @brief Registro de configuracion 3
 */
typedef union
{
	struct
	{
		/**
		 * @brief PS2 length bits
		 */
		unsigned PHSEG2 : 3;
		/**
		 * @brief Reservados
		 */
		unsigned RESERVED : 3;
		/**
		 * @brief Wake-up filter bit
		 */
		unsigned WAKFIL : 1;
		/**
		 * @brief Start-of-frame signal bit
		 */
		unsigned SOF : 1;
	};
	uint8_t data;
} CNF3_t;

/**
 * @brief Registro de control de transimision
 */
typedef union
{
	struct
	{
		/** @brief transmit buffer priority bits */
		unsigned TXP : 2;
		unsigned RESERVED2 : 1;
		/** @brief message transmit request bit */
		unsigned TXREQ : 1;
		/** @brief transmission error detected bit */
		unsigned TXERR : 1;
		/** @brief message lost arbitration bit */
		unsigned MLOA : 1;
		/** @brief message aborted flag bit */
		unsigned ABTF : 1;
		unsigned RESERVED : 1;
	};
	uint8_t data;
} TXBnCTRL_t;

/**
 * @brief Registro de interrupciones
 */
typedef union
{
	struct
	{
		/** @brief Receive buffer 0 full interrupt enable bit */
		unsigned RX0IE : 1;
		/** @brief Receive buffer 1 full interrupt enable bit */
		unsigned RX1IE : 1;
		/** @brief Transmit buffer 0 empty interrupt enable bit */
		unsigned TX0IE : 1;
		/** @brief Transmit buffer 1 empty interrupt enable bit */
		unsigned TX1IE : 1;
		/** @brief Transmit buffer 2 empty interrupt enable bit */
		unsigned TX2IE : 1;
		/** @brief Error interrupt enable bit */
		unsigned ERRIE : 1;
		/** @brief Wake-up interrupt enable */
		unsigned WAKIE : 1;
		/** @brief Message error interrupt enable */
		unsigned MERRE : 1;
	};
	uint8_t data;
} CANINTE_t;

/**
 * @brief Registro CAN INTERRUPT FLAG
 */
typedef union
{
	struct
	{
		/** @brief Receive buffer 0 full interrupt flag bit */
		unsigned RX0IF : 1;
		/** @brief Receive buffer 1 full interrupt flag bit */
		unsigned RX1IF : 1;
		/** @brief Transmit buffer 0 empty interrupt flag bit */
		unsigned TX0IF : 1;
		/** @brief Transmit buffer 1 empty interrupt flag bit */
		unsigned TX1IF : 1;
		/** @brief Transmit buffer 2 empty interrupt flag bit */
		unsigned TX2IF : 1;
		/** @brief Error interrupt flag bit */
		unsigned ERRIF : 1;
		/** @brief Wake-up interrupt flag bit */
		unsigned WAKIF : 1;
		/** @brief Message error interrupt flag bit */
		unsigned MERRF : 1;
	};
	uint8_t data;
} CANINTF_t;

/**
 * @brief Registro de control de can
 */
typedef union
{
	struct
	{
		/**
		 * @brief CLKOUT pin prescaler bits
		 */
		unsigned CLKPRE : 2;
		/**
		 * @brief CLKOUT pin enable bit
		 */
		unsigned CLKEN : 1;
		/**
		 * @brief One-shot mode bit
		 */
		unsigned OSM : 1;
		/**
		 * @brief Abort all pending transmissions bit
		 */
		unsigned ABAT : 1;
		/**
		 * @brief Request operation mode bits
		 */
		unsigned REQ0P : 3;
	};
	uint8_t data;
} CANCTRL_t;

/**
 * @brief Registro ERROR FLAG
 */
typedef union
{
	struct
	{
		/** @brief error warning flag */
		unsigned EWARN : 1;
		/** @brief receive error warning flag */
		unsigned RXWAR : 1;
		/** @brief transmit error warning flag */
		unsigned TXWAR : 1;
		/** @brief receive error-passive flag */
		unsigned RXEP : 1;
		/** @brief transmit error-passive flag */
		unsigned TXEP : 1;
		/** @brief bus-off error flag */
		unsigned TXBO : 1;
		/** @brief Receive buffer 0 overflow */
		unsigned RX0OVR : 1;
		/** @brief Receive buffer 1 overflow */
		unsigned RX1OVR : 1;
	};
	uint8_t data;

} EFLG_t;

/**
 * @brief Registro de control de rxb0
 */
typedef union
{
	struct
	{
		/**
		 * @brief Filter hit bit
		 */
		unsigned FILHIT0 : 1;
		/**
		 * @brief Read-only copy of BUKT bit
		 */
		unsigned BUKT1 : 1;
		/**
		 * @brief Rollver enable bit
		 */
		unsigned BUKT : 1;
		/**
		 * @brief Received remote transfer request bit
		 */
		unsigned RXRTR : 1;
		unsigned RESERVED2 : 1;
		/**
		 * @brief Receive buffer operating mode bits
		 */
		unsigned RXM : 2;
		unsigned RESERVED : 1;
	};
	uint8_t data;
} RXB0CTRL_t;

/**
 * @brief Registro de control de rxb1
 */
typedef union
{
	struct
	{
		/**
		 * @brief Filter hit bits
		 */
		unsigned FILHIT : 3;
		/**
		 * @brief Received remote transfer request bit
		 */
		unsigned RXRTR : 1;
		unsigned RESERVED2 : 1;
		/**
		 * @brief Receive buffer operating mode bits
		 */
		unsigned RXM : 2;
		unsigned RESERVED : 1;
	};
	uint8_t data;
} RXB1CTRL_t;

/**
 * @brief Registro de pin control y estado
 */
typedef union
{
	struct
	{
		/**
		 * @brief ~{TX0RTS} pin mode bit
		 */
		unsigned B0RTSM : 1;
		/**
		 * @brief ~{TX1RTS} pin mode bit
		 */
		unsigned B1RTSM : 1;
		/**
		 * @brief ~{TX2RTS} pin mode bit
		 */
		unsigned B2RTSM : 1;
		/**
		 * @brief ~{TX0RTS} pin state bit
		 */
		unsigned B0RTS : 1;
		/**
		 * @brief ~{TX1RTS} pin state bit
		 */
		unsigned B1RTS : 1;
		/**
		 * @brief ~{TX2RTS} pin state bit
		 */
		unsigned B2RTS : 1;
		unsigned RESERVED2 : 1;
		unsigned RESERVED : 1;
	};
	uint8_t data;
} TXRTSCTRL_t;

/**
 * @brief Registro de id parte alta
 */
typedef union
{
	struct
	{
		/**
		 * @brief Standart identifier bits
		 */
		unsigned SID : 8;
	};
	uint8_t data;
} TXBnSIDH_t;

/**
 * @brief Registro de id parte baja
 */
typedef union
{
	struct
	{
		/**
		 * @brief Extended identifier bits
		 */
		unsigned EID : 2;
		unsigned RESERVED2 : 1;
		/**
		 * @brief Extended identifier enable bit
		 */
		unsigned EXIDE : 1;
		unsigned RESERVED : 1;
		/**
		 * @brief Standard identifier bits
		 */
		unsigned SID : 3;
	};
	uint8_t data;
} TXBnSIDL_t;

/**
 * @brief Registro de id extendida parte alta
 */
typedef union
{
	struct
	{
		/**
		 * @brief Extended identifier bits
		 */
		unsigned EID : 8;
	};
	uint8_t data;
} TXBnEID8_t;

/**
 * @brief Registro de id extendida parte baja
 */
typedef union
{
	struct
	{
		/**
		 * @brief Extended identifier bits
		 */
		unsigned EID : 8;
	};
	uint8_t data;
} TXBnEID0_t;

/**
 * @brief Registro de longitud de datos
 */
typedef union
{
	struct
	{
		/**
		 * @brief Data length code bits
		 */
		unsigned DLC : 4;
		unsigned RESERVED2 : 2;
		/**
		 * @brief Remote transmission request bit
		 */
		unsigned RTR : 1;
		unsigned RESERVED : 1;
	};
	uint8_t data;
} TXBnDLC_t;

/**
 * @brief Registro de datos
 */
typedef union
{
	struct
	{
		/**
		 * @brief Transmit buffer n data field byte m bits
		 */
		unsigned TXBnDm : 8;
	};
	uint8_t data;
} TXBnDm_t;

/**
 * @brief Modificar registro
 *
 * Se carga todo lo necesario en los campos para modificar
 * en el registro determinado. Se debe cargar el registro, la mascara
 * y el dato nuevo.
 */
typedef struct
{
	/**
	 * @brief Nombre del registro a modificar.
	 */
	REGISTER_t reg;
	/**
	 * @brief Mascara.
	 */
	uint8_t mask;
	/**
	 * @brief Dato a modificar.
	 */
	uint8_t data;
} ModifyReg_t;

/**
 * @brief Registros de lectura de datos
 *
 * Utilizada antes de leer sobre un registro en particular.
 * */
typedef struct
{
	/** @brief Registro a leer. */
	REGISTER_t reg;
	/** @brief Datos a cargar. */
	uint8_t data;
} ReadReg_t;

#define MAX_DATA_readREG 10

/**
 * @brief Estructura para la lectura de registros.
 *
 * Esta estructura se utiliza para leer registros especificos
 * con una instruccion asociada y almacenar los datos leidos.
 */
typedef struct
{
	/** @brief Registro en el que se lee.*/
	REGISTER_t reg;
	/** @brief Datos leidos.*/
	uint8_t values[MAX_DATA_readREG];
	/** @brief Longitud de la cadena.*/
	uint8_t n;
} ReadRegs_t;

#define CANT_MAX_SET_REGISTERS 13

/**
 * @brief Dato de tipo seteo de registro
 */
typedef struct
{
	/**
	 * @brief Registro a setear
	 */
	REGISTER_t reg;
	/**
	 * @brief Valor a cargar
	 */
	uint8_t value;
} setRegister_t;

/**
 * @brief Dato de tipo seteo de registros
 */
typedef struct
{
	/**
	 * @brief Registro inicial
	 */
	REGISTER_t reg;
	/**
	 * @brief Arreglo de datos
	 */
	uint8_t values[CANT_MAX_SET_REGISTERS];
	/**
	 * @brief Cantidad de bytes
	 */
	uint8_t n;
} setRegisters_t;

#if USE_FREERTOS
#include "FreeRTOS.h"
#include "task.h"

#define __delay_ms(ms) vTaskDelay(pdMS_TO_TICKS(ms))
#elif (!USE_FREERTOS)
#define __delay_ms(x) delay_ms(x)

