sd2-dsi-fceia/SHIELD-MCXC444-DSI/SD2_4_MCXC444_TestShield_CAN-BUS/source/mcp2515.c
static void delay_ms(uint16_t ms);

static void delay_ms(uint16_t ms)
{
	// Calcula el número de ciclos necesarios
	uint32_t cycles = (CLOCK_GetCoreSysClkFreq() / 1000) * ms / 4;

	// Realiza el bucle para generar el retardo
	for (uint32_t i = 0; i < cycles; i++)
	{
		__NOP(); // No Operation (1 ciclo de instrucción)
	}

	return;
}
#endif

static const uint8_t CANCTRL_REQOP = 0xE0;
// static const uint8_t CANCTRL_ABAT = 0x10;
//  static const uint8_t CANCTRL_OSM = 0x08;
static const uint8_t CANCTRL_CLKEN = 0x04;
static const uint8_t CANCTRL_CLKPRE = 0x03;

static const uint8_t CANSTAT_OPMOD = 0xE0;
// static const uint8_t CANSTAT_ICOD = 0x0E;

static const uint8_t CNF3_SOF = 0x80;

static const uint8_t TXB_EXIDE_MASK = 0x08;
static const uint8_t DLC_MASK = 0x0F;
static const uint8_t RTR_MASK = 0x40;

// static const uint8_t RXBnCTRL_RXM_STD = 0x20;
// static const uint8_t RXBnCTRL_RXM_EXT = 0x40;
static const uint8_t RXBnCTRL_RXM_STDEXT = 0x00;
static const uint8_t RXBnCTRL_RXM_MASK = 0x60;
static const uint8_t RXBnCTRL_RTR = 0x08;
static const uint8_t RXB0CTRL_BUKT = 0x04;
static const uint8_t RXB0CTRL_FILHIT_MASK = 0x03;
static const uint8_t RXB1CTRL_FILHIT_MASK = 0x07;
static const uint8_t RXB0CTRL_FILHIT = 0x00;
static const uint8_t RXB1CTRL_FILHIT = 0x01;

static const uint8_t MCP_SIDH = 0;
static const uint8_t MCP_SIDL = 1;
static const uint8_t MCP_EID8 = 2;
static const uint8_t MCP_EID0 = 3;
static const uint8_t MCP_DLC = 4;
static const uint8_t MCP_DATA = 5;

static const uint8_t STAT_RXIF_MASK = STAT_RX0IF | STAT_RX1IF;

static const uint8_t EFLG_ERRORMASK = EFLG_RX1OVR | EFLG_RX0OVR | EFLG_TXBO | EFLG_TXEP | EFLG_RXEP;

#define N_TXBUFFERS 3
#define N_RXBUFFERS 2

//static const struct TXBn_REGS
//{
//	REGISTER_t CTRL;
//	REGISTER_t SIDH;
//	REGISTER_t DATA;
//} TXB[N_TXBUFFERS];

static const struct RXBn_REGS
{
	REGISTER_t CTRL;
	REGISTER_t SIDH;
	REGISTER_t DATA;
	CANINTF_enum CANINTF_RXnIF;
} RXB[N_RXBUFFERS];

/**
 * @brief Funciones privadas
 * @{
 */
/**
 * @brief Incia la comunicacion spi
 */
static void startSPI(void);
/**
 * @brief Finaliza la comunicacion spi
 */
static void endSPI(void);
/**
 * @brief Seteado el modo de trabajo.
 * @param[in] mode Modo de trabajo
 */
static ERROR_t mcp2515_setMode(const uint8_t mode);
/**
 * @brief Lee un solo registro a la vez
 * @param[in,out] _readReg Puntero al tipo de dato ReadReg_t
 * @return Devuelve el estado de la transferencia
 */
static ERROR_t mcp2515_readRegister(ReadReg_t *readReg);
/**
 * @brief Lee multiples registros a la vez
 * @param[in,out] _readRegs Puntero al tipo de dato
 * @return Devuelve el estado de la transferencia
 */
static ERROR_t mcp2515_readRegisters(ReadRegs_t *_readRegs);
/**
 * @brief Setea un registro
 * @param[in] setReg Parametros
 * @return Devuelve el estado de la transmision
 */
static ERROR_t mcp2515_setRegister(setRegister_t setReg);
/**
 * @brief Setea multiples registros
 * @param[in] SetRegs Parametros
 * @return Devuelve el estado de la transmision
 */
static ERROR_t mcp2515_setRegisters(setRegisters_t setRegs);
/**
 * @brief Modifica un registro en particular
 * @param[in] modifyReg Parametros
 * @return Devuelve el estado de la modificacion
 */
static ERROR_t mcp2515_modifyRegister(ModifyReg_t modifyReg);
/**
 * @brief Configura el id para una accion en particular
 * @param[out] buffer lugar donde se va a cargar el resultado
 * @param[in] ext indica si es de formato extendido
 * @param[in] id valor del id
 */
static void mcp2515_prepareId(uint8_t *buffer, const bool ext,
							  const uint32_t id);
/**
 * @}
 */

// static const struct TXBn_REGS MCP2515_TXB[N_TXBUFFERS] = {
//	{MCP_TXB0CTRL, MCP_TXB0SIDH, MCP_TXB0DATA},
//	{MCP_TXB1CTRL, MCP_TXB1SIDH, MCP_TXB1DATA},
//	{MCP_TXB2CTRL, MCP_TXB2SIDH, MCP_TXB2DATA},
// };

static const struct RXBn_REGS RXB[N_RXBUFFERS] = {
	{MCP_RXB0CTRL, MCP_RXB0SIDH, MCP_RXB0DATA, CANINTF_RX0IF},
	{MCP_RXB1CTRL, MCP_RXB1SIDH, MCP_RXB1DATA, CANINTF_RX1IF},
};

extern void mcp2515_init(void)
{
	spi_init();

	return;
}

static void startSPI(void)
{
	/*
	 * Chip select bajo.
	 *
	 * Baja el chip select del modulo para seleccionarlo y luego
	 * leer o escribir.
	 * */
	CS_LOW;

	return;
}

static void endSPI(void)
{
	/*
	 * Chip select alto.
	 *
	 * Libera el bus del mcp2515.
	 * */
	CS_HIGH;

	return;
}

extern ERROR_t mcp2515_reset(void)
{
	mcp2515_init();	// Configura los pines del spi

	ERROR_t error;
	INSTRUCTION_t inst = INSTRUCTION_RESET;

	/* Reseteamos el modulo */
	startSPI();
	status_t status = spi_write(&inst, 1);
	if (status != kStatus_Success)
		return ERROR_SPI_WRITE;
	endSPI();

	__delay_ms(100);

	/* Limpiamos registros de tx y rx*/
	setRegisters_t setRegs;

#define CANT_REGISTROS 14
	setRegs.n = CANT_MAX_SET_REGISTERS;

	memset(setRegs.values, 0, CANT_REGISTROS);

	setRegs.reg = MCP_TXB0CTRL;
	error = mcp2515_setRegisters(setRegs);
	if (error != ERROR_OK)
		return error;

	setRegs.reg = MCP_TXB1CTRL;

	error = mcp2515_setRegisters(setRegs);
	if (error != ERROR_OK)
		return error;
	setRegs.reg = MCP_TXB2CTRL;

	error = mcp2515_setRegisters(setRegs);
	if (error != ERROR_OK)
		return error;

	setRegister_t setReg;

	setReg.reg = MCP_RXB0CTRL, setReg.value = 0;
	error = mcp2515_setRegister(setReg);
	/*
	 * No se detecta el error dado que queremos que
	 * sea cero el registro.
	 * */

	setReg.reg = MCP_RXB1CTRL, setReg.value = 0;
	error = mcp2515_setRegister(setReg);

	/* Habilitamos interrupciones */
	setReg.reg = MCP_CANINTE;
	setReg.value = CANINTF_RX0IF | CANINTF_RX1IF | CANINTF_ERRIF | CANINTF_MERRF;
	error = mcp2515_setRegister(setReg);
	if (error != ERROR_OK)
		return error;

	/* Verificamos que se cargo correctamente */
	ReadReg_t readReg;

	readReg.reg = MCP_CANINTE;
	readReg.data = 0;

	error = mcp2515_readRegister(&readReg);
	if (error != ERROR_OK)
		return error;
	if (setReg.value != readReg.data)
		return ERROR_VERIFICACION_SET_REGISTER;

	/* Configuramos parametros del rx */
	ModifyReg_t modifyReg;

	modifyReg.reg = MCP_RXB0CTRL;
	modifyReg.mask = RXBnCTRL_RXM_MASK | RXB0CTRL_BUKT | RXB0CTRL_FILHIT_MASK;
	modifyReg.data = RXBnCTRL_RXM_STDEXT | RXB0CTRL_BUKT | RXB0CTRL_FILHIT;
	error = mcp2515_modifyRegister(modifyReg);
	if (error != ERROR_OK)
		return error;

	/* Verificamos */
	readReg.reg = MCP_RXB0CTRL;
	error = mcp2515_readRegister(&readReg);
	if ((readReg.data & modifyReg.data) == 0)
		return ERROR_VERIFICAION_MODIFY_REG;

