sd2-dsi-fceia/SHIELD-MCXC444-DSI/SD2_4_MCXC444_TestShield_CAN-BUS/source/mcp2515.c
	modifyReg.reg = MCP_RXB1CTRL;
	modifyReg.mask = RXBnCTRL_RXM_MASK | RXB1CTRL_FILHIT_MASK;
	modifyReg.data = RXBnCTRL_RXM_STDEXT | RXB1CTRL_FILHIT;
	error = mcp2515_modifyRegister(modifyReg);
	if (error != ERROR_OK)
		return error;

	/* Limpiamos los filtros y mascaras */
	RXF filters[] = {RXF0, RXF1, RXF2, RXF3, RXF4, RXF5};
	for (int i = 0; i < 6; i++)
	{
		bool ext = (i == 1);
		error = mcp2515_setFilter(filters[i], ext, 0);
		if (error != ERROR_OK)
			return error;
	}

	MASK masks[] = {MASK0, MASK1};
	for (int i = 0; i < 2; i++)
	{
		error = mcp2515_setFilterMask(masks[i], true, 0);
		if (error != ERROR_OK)
			return error;
	}

	return ERROR_OK;
}

static ERROR_t mcp2515_readRegister(ReadReg_t *readReg)
{
	INSTRUCTION_t inst = INSTRUCTION_READ;
	status_t status;

	startSPI();
	status = spi_write(&inst, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_write(&readReg->reg, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_receive(&readReg->data, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_READ;
	}
	endSPI();

	return ERROR_OK;
}

static ERROR_t mcp2515_readRegisters(ReadRegs_t *readRegs)
{
	INSTRUCTION_t inst = INSTRUCTION_READ;
	status_t status;

	startSPI();
	status = spi_write(&inst, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_write(&readRegs->reg, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_receive(readRegs->values, readRegs->n);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_READ;
	}
	endSPI();

	return ERROR_OK;
}

static ERROR_t mcp2515_setRegister(setRegister_t setReg)
{
	status_t status;
	INSTRUCTION_t instruction = INSTRUCTION_WRITE;

	/* Envia los datos al modulo mediante spi */
	startSPI();
	status = spi_write(&instruction, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_write(&setReg.reg, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_write(&setReg.value, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}
	endSPI();

	//	/* Verificamos que se cargo correctamente la informacion */
	// #define MAX_INTENTOS 3
	//
	//	ReadReg_t readReg = {
	//		.reg = setReg.reg,
	//		.data = 0,
	//	};
	//
	//	for (uint8_t i = 0; i < MAX_INTENTOS; i++)
	//	{
	//		ERROR_t error = mcp2515_readRegister(&readReg);
	//		if (error != ERROR_OK)
	//			return error;
	//		if (readReg.data & setReg.value)
	//			return ERROR_OK;
	//	}
	//
	//	return ERROR_VERIFICACION_SET_REGISTER;
	return ERROR_OK;
}

static ERROR_t mcp2515_setRegisters(setRegisters_t setRegs)
{
	status_t status;
	INSTRUCTION_t _instruction = INSTRUCTION_WRITE;

	/* Envia los datos al modulo mediante spi */
	startSPI();
	status = spi_write(&_instruction, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_write(&setRegs.reg, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_write(setRegs.values, setRegs.n);

#if USE_FREERTOS

	__delay_ms(5);

#else

	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

#endif

	endSPI();

	return ERROR_OK;
}

static ERROR_t mcp2515_modifyRegister(ModifyReg_t modifyReg)
{
	INSTRUCTION_t _instruction = INSTRUCTION_BITMOD;
	status_t status;

	startSPI();
	status = spi_write(&_instruction, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}

	status = spi_write(&modifyReg.reg, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}
	status = spi_write(&modifyReg.mask, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}
	status = spi_write(&modifyReg.data, 1);
	if (status != kStatus_Success)
	{
		endSPI();
		return ERROR_SPI_WRITE;
	}
	endSPI();

	return ERROR_OK;
}

extern uint8_t mcp2515_getStatus(void)
{
	INSTRUCTION_t _instruction = INSTRUCTION_READ_STATUS;
	uint8_t i, n = 1;

	startSPI();
	spi_write(&_instruction, 1);
	spi_receive(&i, n);
	endSPI();

	return i;
}

extern ERROR_t mcp2515_setConfigMode()
{
	CANCTRL_t canctrl = {.data = 0};

	/* Modificamos el modo del trabajo del modulo */
	/*
	 * El modulo puede trabajar en 5 modos distintos.
	 * 		1. Modo de configuracion.	--> En particular trabajamos en este durante la incializacion.
	 * 		2. Modo normal.
	 * 		3. Modo sleep.
	 * 		4. Modo de solo escucha.
	 * 		5. Modo de loopback.
	 * */
	canctrl.REQ0P = 0b100; /* El modulo entra en modo de configuracion.*/

	return mcp2515_setMode(canctrl.data);
}

extern ERROR_t mcp2515_setListenOnlyMode()
{
	CANCTRL_t canctrl = {.data = 0};

	canctrl.REQ0P = 0b011; /*< Modo de solo escucha.*/

	return mcp2515_setMode(canctrl.data);
}

extern ERROR_t mcp2515_setSleepMode()
{
	CANCTRL_t canctrl = {.data = 0};

	canctrl.REQ0P = 0b001; /*< Modo sleep de operacion.*/

	return mcp2515_setMode(canctrl.data);
}

extern ERROR_t mcp2515_setLoopbackMode()
{
	CANCTRL_t canctrl = {.data = 0};

	canctrl.REQ0P = 0b010; /*< Modo loopback de operacion.*/

	return mcp2515_setMode(canctrl.data);
}

extern ERROR_t mcp2515_setNormalMode()
{
	CANCTRL_t canctrl = {.data = 0};

	canctrl.REQ0P = 0b000; /* Modo normal de operacion.*/

	return mcp2515_setMode(canctrl.data);
}

extern ERROR_t mcp2515_setMode(const uint8_t mode)
{
	ERROR_t error;

	ModifyReg_t modifyReg = {
		.reg = MCP_CANCTRL,	   /* Registro de can control.*/
		.mask = CANCTRL_REQOP, /* Corresponde a REQ0P[2:0].*/
		.data = mode,		   /* Modo de operacion del modulo.*/
	};

	/* Configura el modo de operacion del modulo */
	error = mcp2515_modifyRegister(modifyReg);
	if (error != ERROR_OK)
		return error;

	__delay_ms(50);

	/* Verifica que se configuro el modo correctamente */
#define CANT_INTENTOS 3

	bool modeMatch = false;
	ReadReg_t readReg = {
		.reg = MCP_CANSTAT,
		.data = 0,
	};

	for (uint8_t i = 0; i < CANT_INTENTOS; i++)
	{
		error = mcp2515_readRegister(&readReg); /* Lee el registro para corroborar la informacion. */
		if (error != ERROR_OK)
			return error;

		readReg.data &= CANSTAT_OPMOD;
		modeMatch = (readReg.data == mode);

		if (modeMatch)
			break;
	}

	return modeMatch ? ERROR_OK : ERROR_FAIL;
}

extern ERROR_t mcp2515_setBitrate(const CAN_SPEED canSpeed, CAN_CLOCK canClock)
{
	/* Entra en modo de configuracion */
	ERROR_t error = mcp2515_setConfigMode();

	if (error != ERROR_OK)
	{
		return error;
	}

	/* Elije la frecuencia y bits por segundos */
	/*
	 * Por ejemplo: 16 Mhz y 125 kBps.
	 * */
	uint8_t set, cfg1, cfg2, cfg3;

	set = 1;

	switch (canClock)
	{
	case (MCP_8MHZ):
		switch (canSpeed)
		{
		case (CAN_5KBPS): //   5KBPS
			cfg1 = MCP_8MHz_5kBPS_CFG1;
			cfg2 = MCP_8MHz_5kBPS_CFG2;
			cfg3 = MCP_8MHz_5kBPS_CFG3;
			break;

		case (CAN_10KBPS): //  10KBPS
			cfg1 = MCP_8MHz_10kBPS_CFG1;
			cfg2 = MCP_8MHz_10kBPS_CFG2;
			cfg3 = MCP_8MHz_10kBPS_CFG3;
			break;

		case (CAN_20KBPS): //  20KBPS
			cfg1 = MCP_8MHz_20kBPS_CFG1;
			cfg2 = MCP_8MHz_20kBPS_CFG2;
			cfg3 = MCP_8MHz_20kBPS_CFG3;
			break;

		case (CAN_31K25BPS): //  31.25KBPS
			cfg1 = MCP_8MHz_31k25BPS_CFG1;
			cfg2 = MCP_8MHz_31k25BPS_CFG2;
			cfg3 = MCP_8MHz_31k25BPS_CFG3;
			break;

		case (CAN_33KBPS): //  33.333KBPS
			cfg1 = MCP_8MHz_33k3BPS_CFG1;
			cfg2 = MCP_8MHz_33k3BPS_CFG2;
			cfg3 = MCP_8MHz_33k3BPS_CFG3;
			break;

		case (CAN_40KBPS): //  40Kbps
			cfg1 = MCP_8MHz_40kBPS_CFG1;
			cfg2 = MCP_8MHz_40kBPS_CFG2;
			cfg3 = MCP_8MHz_40kBPS_CFG3;
			break;

		case (CAN_50KBPS): //  50Kbps
			cfg1 = MCP_8MHz_50kBPS_CFG1;
			cfg2 = MCP_8MHz_50kBPS_CFG2;
			cfg3 = MCP_8MHz_50kBPS_CFG3;
			break;

		case (CAN_80KBPS): //  80Kbps
			cfg1 = MCP_8MHz_80kBPS_CFG1;
			cfg2 = MCP_8MHz_80kBPS_CFG2;
			cfg3 = MCP_8MHz_80kBPS_CFG3;
			break;

		case (CAN_100KBPS): // 100Kbps
			cfg1 = MCP_8MHz_100kBPS_CFG1;
			cfg2 = MCP_8MHz_100kBPS_CFG2;
			cfg3 = MCP_8MHz_100kBPS_CFG3;
			break;

		case (CAN_125KBPS): // 125Kbps
			cfg1 = MCP_8MHz_125kBPS_CFG1;
			cfg2 = MCP_8MHz_125kBPS_CFG2;
			cfg3 = MCP_8MHz_125kBPS_CFG3;
			break;

