sd2-dsi-fceia/SHIELD-MCXC444-DSI/SD2_4_MCXC444_TestShield_CAN-BUS/source/mcp2515.c
extern ERROR_t mcp2515_setFilterMask(const MASK mask, const bool ext,
									 const uint32_t ulData)
{
	/* Setea al modulo en modo de configuracion */
	ERROR_t res = mcp2515_setConfigMode();

	if (res != ERROR_OK)
		return res;

		/* Cargamos los datos */
#define CANT_REGS 4
	setRegisters_t setRegs;

	setRegs.n = CANT_REGS;
	mcp2515_prepareId(setRegs.values, ext, ulData);

	switch (mask)
	{
	case MASK0:
		setRegs.reg = MCP_RXM0SIDH;
		break;
	case MASK1:
		setRegs.reg = MCP_RXM1SIDH;
		break;
	default:
		return ERROR_FAIL;
	}

	/* Limpia los registros de la mascara */
	/*
	 * Tenemos los siguiente registros para la mascara para RX0:
	 * 		1. RXM0SIDH.
	 * 		2. RXM0SIDL.
	 * 		3. RXM0EID8.
	 * 		4. RXM0EID0.
	 * Para RX1 lo mismo.
	 * */
	mcp2515_setRegisters(setRegs);

	return ERROR_OK;
}

extern ERROR_t mcp2515_setFilter(const RXF num, const bool ext,
								 const uint32_t ulData)
{
	/* Configura el modo de configuracion */
	ERROR_t res = mcp2515_setConfigMode();

	if (res != ERROR_OK)
		return res;

	/* Carga el registro */
	REGISTER_t reg;

	switch (num)
	{
	case RXF0:
		reg = MCP_RXF0SIDH;
		break;
	case RXF1:
		reg = MCP_RXF1SIDH;
		break;
	case RXF2:
		reg = MCP_RXF2SIDH;
		break;
	case RXF3:
		reg = MCP_RXF3SIDH;
		break;
	case RXF4:
		reg = MCP_RXF4SIDH;
		break;
	case RXF5:
		reg = MCP_RXF5SIDH;
		break;
	default:
		return ERROR_FAIL;
	}

#define CANT_BUFFER 4
	setRegisters_t setRegs;

	setRegs.reg = reg;
	setRegs.n = CANT_BUFFER;

	mcp2515_prepareId(setRegs.values, ext, ulData);

	ERROR_t error = mcp2515_setRegisters(setRegs);
	if (error != ERROR_OK)
		return error;

	return ERROR_OK;
}

extern ERROR_t mcp2515_sendMessageWithBufferId(const TXBn txbn,
											   const struct can_frame *frame)
{
	ERROR_t error;

	struct {
		REGISTER_t TxBSIDH;
		REGISTER_t TxBCTRL;
	} RegistroTx;

	switch (txbn)
	{
		case TXB0:
			RegistroTx.TxBCTRL = MCP_TXB0CTRL;
			RegistroTx.TxBSIDH = MCP_TXB0SIDH;
			break;
		case TXB1:
			RegistroTx.TxBCTRL = MCP_TXB1CTRL;
			RegistroTx.TxBSIDH = MCP_TXB1SIDH;
			break;
		case TXB2:
			RegistroTx.TxBCTRL = MCP_TXB2CTRL;
			RegistroTx.TxBSIDH = MCP_TXB2SIDH;
			break;
		default:
			error = ERROR_FAIL;
			break;
	}

	/* Verifica que no se supere la cantidad maxima de datos */
	if (frame->can_dlc > CAN_MAX_DLEN)
		return ERROR_FAILTX;

	/* Envia la informacion */
	setRegisters_t setRegs;

	setRegs.values[0] = '\0';

	/*
	 * Formato de data[13]:
	 * 		byte 0: SIDH
	 * 		byte 1: SIDL
	 * 		byte 2: EID8
	 * 		byte 3: EID0
	 * 		byte 4: TXBnDLC
	 * 		byte 5-13: Data frame
	 * */

	bool ext = (frame->can_id & CAN_EFF_FLAG); /* Determina si es de formato extendido.*/
	bool rtr = (frame->can_id & CAN_RTR_FLAG); /* Determina si RTR se encuentra en '1'.*/
	uint32_t id = (frame->can_id & (ext ? CAN_EFF_MASK : CAN_SFF_MASK));

	/* Cargo los bytes del 0 al 3 */
	mcp2515_prepareId(setRegs.values, ext, id);

	/* Cargo el byte 4 */
	setRegs.values[MCP_DLC] = rtr ? (frame->can_dlc | RTR_MASK) : frame->can_dlc;

	/* Cargos los bytes del 5 al 13 */
	memcpy(&setRegs.values[MCP_DATA], frame->data, frame->can_dlc);

	/* Envia los datos */
	setRegs.n = 5 + frame->can_dlc;
//	setRegs.reg = txbuf->SIDH;
	setRegs.reg = RegistroTx.TxBSIDH;
	error = mcp2515_setRegisters(setRegs);
	if (error != ERROR_OK)
		return error;

	/* Configura el registro control */
	ModifyReg_t modifyReg;

//	modifyReg.reg = txbuf->CTRL;
	modifyReg.reg = RegistroTx.TxBCTRL;
	modifyReg.mask = TXB_TXREQ;
	modifyReg.data = TXB_TXREQ;
	error = mcp2515_modifyRegister(modifyReg);
	if (error != ERROR_OK)
		return error;

	/* Verifica la informacion enviada */
	ReadReg_t readReg = {
//		.reg = txbuf->CTRL,
		.reg = RegistroTx.TxBCTRL,
		.data = 0,
	};

//#if (!USE_FREERTOS)

	error = mcp2515_readRegister(&readReg);
	if (error != ERROR_OK)
		return error;

	if ((readReg.data & (TXB_ABTF	/*< Message aborted flag bit.*/
						 | TXB_MLOA /*< Message lost arbitration bit.*/
						 | TXB_TXERR /*< Transmission error detected bit.*/)) != 0)
	{
		return ERROR_FAILTX;
	}

//#endif

	return ERROR_OK;
}

extern ERROR_t mcp2515_sendMessage(const struct can_frame *frame)
{
	/* Verifica que no supera la cantidad maxima de bytes */
	if (frame->can_dlc > CAN_MAX_DLEN)
	{
		return ERROR_FAILTX;
	}

	/* Verificamos que exista lugar disponible en algun buffer (0,1,2) */
	TXBn txBuffers[N_TXBUFFERS] = {TXB0, TXB1, TXB2};
	REGISTER_t TxnControl[N_TXBUFFERS] = {MCP_TXB0CTRL, MCP_TXB1CTRL, MCP_TXB2CTRL};

	for (int i = 0; i < N_TXBUFFERS; i++)
	{
		ReadReg_t readReg;

//		readReg.reg = txbuf->CTRL;
		readReg.reg = TxnControl[i];
		ERROR_t error = mcp2515_readRegister(&readReg);
		if (error != ERROR_OK)
			return error;

		if ((readReg.data & TXB_TXREQ) == 0)
		{
			return mcp2515_sendMessageWithBufferId(txBuffers[i], frame);
		}
	}

	/* Solo si los 3 buffers estan ocupados */
	return ERROR_ALLTXBUSY;
}

extern ERROR_t mcp2515_readMessageWithBufferId(const RXBn rxbn,
											   struct can_frame *frame)
{
	ERROR_t error;
	const struct RXBn_REGS *rxb = &RXB[rxbn];

	ReadRegs_t readRegs = {
		.reg = rxb->SIDH,
		.n = 5,
	};

	/* Lee las id de formato estandar y extendido */
	/*
	 * Se carga el valor de la id estandar y extendida
	 * al tipo de dato. Para esto debemos cargar el
	 * registro donde vamos a leer. Este registro
	 * puede ser al buffer 0 o al 1.
	 * */
	error = mcp2515_readRegisters(&readRegs);
	if (error != ERROR_OK)
		return error;

	/* Tomamos el valor del id */
	/*
	 * Leemos desde el registro sidh. Por tanto tenemos
	 * SIDH, SIDL, EXID0, EXID8, ...
	 *
	 * id = SIDH(8 bits) + SIDL(3 bits estandart + 2 bits extendido) + EXID8(8 bits ext) + EXID0()
	 * */
	uint32_t id = (readRegs.values[MCP_SIDH] << 3) + (readRegs.values[MCP_SIDL] >> 5);

	/* Verifica si se enuentra en formato extendido */
	if ((readRegs.values[MCP_SIDL] & TXB_EXIDE_MASK) == TXB_EXIDE_MASK)
	{
		id = (id << 2) + (readRegs.values[MCP_SIDL] & 0x03); /*< Agarra los bits 16 y 17 del exid.*/
		id = (id << 8) + readRegs.values[MCP_EID8];			 /*< 8 bits de la parte alta.*/
		id = (id << 8) + readRegs.values[MCP_EID0];			 /*< 8 bits de la parte baja.*/
		id |= CAN_EFF_FLAG;
	}

