sd2-dsi-fceia/SHIELD-MCXC444-DSI/SD2_4_MCXC444_TestShield_CAN-BUS/source/mcp2515.c
	/* Determina la cantidad de data frame a recibir */
	uint8_t dlc = (readRegs.values[MCP_DLC] & DLC_MASK);

	if (dlc > CAN_MAX_DLEN)
		return ERROR_FAIL;

	/* Leemos el registro de control */
	ReadReg_t readReg;

	readReg.reg = rxb->CTRL;
	readReg.data = 0;
	error = mcp2515_readRegister(&readReg);
	if (error != ERROR_OK)
		return error;

	if (readReg.data & RXBnCTRL_RTR)
	{
		id |= CAN_RTR_FLAG;
	}

	frame->can_id = id;
	frame->can_dlc = dlc;

	readRegs.reg = rxb->DATA;
	readRegs.n = dlc;
	error = mcp2515_readRegisters(&readRegs);
	if (error != ERROR_OK)
		return error;

	memcpy(frame->data, readRegs.values, dlc);

	/* Modificamos el registro de interrupciones can */
	ModifyReg_t modifyReg = {
		.reg = MCP_CANINTF,
		.mask = rxb->CANINTF_RXnIF,
		.data = 0,
	};

	error = mcp2515_modifyRegister(modifyReg);
	if (error != ERROR_OK)
		return error;

	return ERROR_OK;
}

extern ERROR_t mcp2515_readMessage(struct can_frame *frame)
{
	ERROR_t error;
	uint8_t stat = mcp2515_getStatus();

	if (stat & STAT_RX0IF)
	{
		error = mcp2515_readMessageWithBufferId(RXB0, frame);
	}
	else if (stat & STAT_RX1IF)
	{
		error = mcp2515_readMessageWithBufferId(RXB1, frame);
	}
	else
	{
		error = ERROR_NOMSG;
	}

	return error;
}

extern bool mcp2515_checkReceive(void)
{
	uint8_t res = mcp2515_getStatus();

	if (res & STAT_RXIF_MASK)
	{
		return true;
	}
	else
	{
		return false;
	}
}

extern bool mcp2515_checkError(void)
{
	uint8_t eflg = mcp2515_getErrorFlags();

	if (eflg & EFLG_ERRORMASK)
	{
		return true;
	}
	else
	{
		return false;
	}
}

extern uint8_t mcp2515_getErrorFlags(void)
{
	/*
		Para detectar errores podemos acceder al registro ERROR FLAG,
		corresponde al valor de 0x2D = 45. Dentro de esto tenemos
		errores por: overflow de buffer de rx, errores en transmision,
		errores en recepcion, etc.
	*/

	ReadReg_t _readReg = {
		.reg = MCP_EFLG,
	};

	mcp2515_readRegister(&_readReg);

	return _readReg.data;
}

extern void mcp2515_clearRXnOVRFlags(void)
{
	ModifyReg_t modifyReg = {
		.reg = MCP_EFLG,
		.mask = EFLG_RX0OVR | EFLG_RX1OVR, /*EFLG_RX0OVR | EFLG_RX1OVR*/
		.data = 0,
	};

	mcp2515_modifyRegister(modifyReg);

	return;
}

volatile static CANINTF_t IntMCP2515 = {0};

extern ERROR_t mcp2515_getInterrupts(void)
{
	ReadReg_t readReg = {
		.reg = MCP_CANINTF,
		.data = 0,
	};

	ERROR_t error = mcp2515_readRegister(&readReg);
	if (error != ERROR_OK)
		return error;

	IntMCP2515.data = readReg.data;

	return error;
}

extern void mcp2515_clearInterrupts(void)
{
	setRegister_t setReg;

	setReg.reg = MCP_CANINTF;
	setReg.value = 0;
	mcp2515_setRegister(setReg);

	IntMCP2515.data = 0;

	return;
}

extern uint8_t mcp2515_getInterruptMask(void)
{
	ReadReg_t readReg = {
		.reg = MCP_CANINTE,
	};

	mcp2515_readRegister(&readReg);

	return readReg.data;
}

extern void mcp2515_clearTXInterrupts(void)
{
	ModifyReg_t modifyReg = {
		.reg = MCP_CANINTF,
		.mask = CANINTF_TX0IF | CANINTF_TX1IF | CANINTF_TX2IF, /*(CANINTF_TX0IF | CANINTF_TX1IF | CANINTF_TX2IF),*/
		.data = 0,
	};

	mcp2515_modifyRegister(modifyReg);

	IntMCP2515.TX0IF = 0;
	IntMCP2515.TX1IF = 0;
	IntMCP2515.TX2IF = 0;

	return;
}

extern void mcp2515_clearRXnOVR(void)
{
	uint8_t eflg = mcp2515_getErrorFlags();

	if (eflg != 0)
	{
		mcp2515_clearRXnOVRFlags(); /* Detecta si existe un overflow */
		mcp2515_clearInterrupts();	/* Limpia todas las interrupciones */
									// modifyRegister(MCP_CANINTF, CANINTF_ERRIF, 0);
	}

	return;
}

extern void mcp2515_clearMERR()
{
	ModifyReg_t modifyReg = {
		.reg = MCP_CANINTF,
		.mask = CANINTF_MERRF, // CANINTF_MERRF
		.data = 0,
	};

	// modifyRegister(MCP_EFLG, EFLG_RX0OVR | EFLG_RX1OVR, 0);
	// clearInterrupts();
	mcp2515_modifyRegister(modifyReg);

	IntMCP2515.MERRF = 0;

	return;
}

extern void mcp2515_clearERRIF()
{
	ModifyReg_t modifyReg = {
		.reg = MCP_CANINTF,
		.mask = CANINTF_ERRIF,
		.data = 0,
	};

	// modifyRegister(MCP_EFLG, EFLG_RX0OVR | EFLG_RX1OVR, 0);
	// clearInterrupts();
	mcp2515_modifyRegister(modifyReg);

	IntMCP2515.ERRIF = 0;

	return;
}

extern uint8_t mcp2515_errorCountRX(void)
{
	ReadReg_t readReg = {
		.reg = MCP_REC,
		.data = 0,
	};

	mcp2515_readRegister(&readReg);

	return readReg.data;
}


extern uint8_t mcp2515_errorCountTX(void)
{
	ReadReg_t readReg = {
		.reg = MCP_TEC,
		.data = 0,
	};

	mcp2515_readRegister(&readReg);

	return readReg.data;
}

extern bool mcp2515_getIntERRIF(void)
{
	return IntMCP2515.ERRIF;
}

extern bool mcp2515_getIntMERRF(void)
{
	return IntMCP2515.MERRF;
}

extern bool mcp2515_getIntRX1IF(void)
{
	bool aux = IntMCP2515.RX1IF;

	IntMCP2515.RX1IF = 0;

	return aux;
}

extern bool mcp2515_getIntRX0IF(void)
{
	bool aux = IntMCP2515.RX0IF;

	IntMCP2515.RX0IF = 0;

	return aux;
}

extern bool mcp2515_getIntTX0IF(void)
{
	return IntMCP2515.TX0IF;
}

extern bool mcp2515_getIntTX1IF(void)
{
	return IntMCP2515.TX1IF;
}

extern bool mcp2515_getIntTX2IF(void)
{
	return IntMCP2515.TX2IF;
}
